backend/app/controllers/api/v1/projects_controller.rb

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ProjNewName1"], ["description", "Test"], ["created_at", "2022-05-16 12:16:48.089208"], ["updated_at", "2022-05-16 12:16:48.089208"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Project 14"], ["description", "Project 14"], ["updated_at", "2019-11-15 10:00:03.726571"], ["id", 1]]
---
  def update
    if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
  def destroy

    if @project.destroy