backend/app/controllers/api/v1/tasks_controller.rb

    task = Task.new(task_params)
    @task = @project.tasks.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "created_at", "updated_at", "project_id") VALUES (?, ?, ?, ?)  [["name", "Task2"], ["created_at", "2019-11-11 07:33:11.903074"], ["updated_at", "2019-11-11 07:33:11.903074"], ["project_id", 1]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "ProjNewName1"], ["updated_at", "2019-11-11 07:41:17.320488"], ["id", 2]]

  def destroy

    if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]

  def load_project
    @project = Project.first
---
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT ?  [["LIMIT", 1]]